
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/takahashigo/aws-ecs-terraform/actions/runs/6032414054)



<pre><code>Apply complete! Resources: 2 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-07206b77599279d94]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0f02832e78f6e2dfe]
aws_security_group.alb: Refreshing state... [id=sg-03615ef4987605c19]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0afbd3a696cf66d42]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-00e434556ea5e2b8f]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0fba776af7d0a0ae3]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:147481072673:targetgroup/go-simple-server-target-group/96119dfc435e355c]
aws_security_group.ecs: Refreshing state... [id=sg-033f317a466bc3a00]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-09c7fbaa592d41099]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-080560f406407f15a]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0a0df0b3cac51798e]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0bbdcfeafa083cd2a]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0ee221464f4fea9d2]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0b0153885fce04ca4]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-06a85a3185ba26ebc]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-078df85a1223aebc4]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-257126802]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-081c5df07b4b9db84]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0bf35a39473ae8a36]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0f9d3335249f21f49]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:147481072673:loadbalancer/app/go-simple-server-alb/bfc568425394aad3]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-06baa4459bd13abb7]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0f0e15f5310f655d7]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-06a85a3185ba26ebc1080289494]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-043d38a414d2f69b5]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0f790d624e974ecae]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0a0df0b3cac51798e1080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-09c7fbaa592d410991080289494]
aws_lb_listener.alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:147481072673:listener/app/go-simple-server-alb/bfc568425394aad3/a710aaca26c1737f]
aws_lb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:147481072673:listener-rule/app/go-simple-server-alb/bfc568425394aad3/a710aaca26c1737f/f23faae3a59d6ccb]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.ecr_lifecycle_policy will be created
  + resource "aws_ecr_lifecycle_policy" "ecr_lifecycle_policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 30 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 30
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "go-simple-server"
    }

  # aws_ecr_repository.ecr_repository will be created
  + resource "aws_ecr_repository" "ecr_repository" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "go-simple-server"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
aws_ecr_repository.ecr_repository: Creating...
aws_ecr_repository.ecr_repository: Creation complete after 1s [id=go-simple-server]
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creating...
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creation complete after 1s [id=go-simple-server]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":5,"Program":"tfcmt","SHA1":"7d11f7010d774f5e9f86c02577ca3df3b6248034","Vars":{},"WorkflowName":"Terraform"} -->